//Процюк

/*
4.	Написать программу обмена значениями двух переменных:
а) с использованием третьей переменной;
б) * без использования третьей переменной.


5.	а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.
б) * Сделать задание, только вывод организовать в центре экрана.
 в) ** Сделать задание б с использованием собственных методов(например, Print(string ms, int x, int y).

*/



using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApplication2
{
    class Program
    {

        static void WW (string text, int x, int y)
        {
            Console.SetCursorPosition(x,y);
            Console.ForegroundColor = ConsoleColor.Red;
            Console.WriteLine(text);
            Console.ResetColor();
        }



        static void Main(string[] args)
        {
            Console.Write("Введите а\n>");
            double a = Convert.ToDouble(Console.ReadLine());
            Console.Write("Введите b)\n>");
            double b = Convert.ToDouble(Console.ReadLine());

            double c = a;
            a = b;
            b = c;

            Console.WriteLine("{0}  {1}", a, b);

            a = a + b;
            b = a - b;
            a = a - b;

            int wi = Console.BufferWidth;
            WW(Convert.ToString(wi), wi/2, 10);

            Console.WriteLine("{0}  {1}", a, b);

            Console.ReadKey();
        }
    }
}
