//Процюк

/*1.	Написать программу «Анкета». Последовательно задаются вопросы(имя, фамилия, возраст, рост, вес).  
В результате вся информация выводится в одну строчку:
а) используя склеивание;
б) используя форматированный вывод;
    в) используя вывод со знаком $.
*/



using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


namespace ConsoleApplication2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Введите ваше имя");
            string Name = Console.ReadLine();
            Console.WriteLine("Введите вашу фамилию");
            string Sename = Console.ReadLine();
            Console.WriteLine("Введите ваш возраст");
            string Age = Console.ReadLine();
            Console.WriteLine("Введите ваш рост");
            string Lenght = Console.ReadLine();
            Console.WriteLine("Введите ваш вес");
            string Mas = Console.ReadLine();

            Console.WriteLine(Name+" "+Sename + " " +Age + " " +Lenght + " " +Mas);

            Console.WriteLine("{0} {1} {2} {3} {4}", Name, Sename, Age, Lenght, Mas);

            Console.WriteLine($"{Name}, {Sename}, {Age}, {Lenght}, {Mas}");

            Console.ReadKey();
        }
    }
}
